src/turbulenceTrial/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

xmin  0;
xmax  1.5;
ymin  0;
ymax  2.2;//1.7;
zmin  0;
zmax  1;

xmin1  1.5;
xmax1  2.5;
ymin1  0;
ymax1  2.2;//1.7;
zmin1  0;
zmax1  1;

// yangle 
yangle    ${yangle};
//yangle    0.091;// =5 deg
//yangle    0.182;// =10 deg
//yangle  0.273;// =15 deg
//yangle    0.364;// =20 deg
//yangle    0.455;// =25 deg
//yangle    0.546;// =30 deg
//yangle    0.707;// =45 deg

// Number of cells
num_xcells ${num_xcells};
num_ycells ${num_ycells};

// Compute total domain length
xlength #eval "$xmax1 - $xmin";

// Compute cell fractions
fraction1 #eval "($xmax - $xmin) / $xlength";
fraction2 #eval "($xmax1 - $xmin1) / $xlength";

// Compute number of x-cells per block
xcells  #eval "round($fraction1 * $num_xcells)";
xcells1 #eval "round($fraction2 * $num_xcells)";

// Compute number of y-cells
ycells  #eval "$num_ycells * ($ymax - $ymin) / $ymax";
ycells1 #eval "$num_ycells * ($ymax1 - $ymin1) / $ymax";

zcells 1;

vertices        
(
    ($xmin  $ymin  $zmin)	//0
    ($xmax  $ymin  $zmin)	//1
    ($xmax  $ymax  $zmin)	//2
    ($xmin  $ymax  $zmin)	//3
    ($xmin  $ymin  $zmax)	//4
    ($xmax  $ymin  $zmax)	//5
    ($xmax  $ymax  $zmax)	//6
    ($xmin  $ymax  $zmax)	//7

    ($xmin1  $ymin1  $zmin1)	//8
    ($xmax1  $yangle $zmin1)	//9
    ($xmax1  $ymax1  $zmin1)	//10
    ($xmin1  $ymax1  $zmin1)	//11
    ($xmin1  $ymin1  $zmax1)	//12
    ($xmax1  $yangle $zmax1)	//13
    ($xmax1  $ymax1  $zmax1)	//14
    ($xmin1  $ymax1  $zmax1)	//15
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) ($xcells $ycells $zcells) simpleGrading (1 1 1)	//(1 10 1)
    hex (8 9 10 11 12 13 14 15) ($xcells1 $ycells1 $zcells) simpleGrading (1 1 1)
);

edges
(
);

boundary       
(

    inlet
    {
	type patch;
        faces ((0 4 7 3));
    }

    //maxX
    interface1
    {
	type patch;
        faces ((2 6 5 1));
    }

    sym
    {
	//type patch;
    type symmetry;
        faces ((1 5 4 0));
    }

    wedge
    {
	// type patch;
    type wall;
        faces ((9 13 12 8));
    }

    top
    {
	type patch;
        faces ((3 7 6 2) (11 15 14 10));
    }

    back
    {
	type empty;
        faces ((0 3 2 1) (8 11 10 9));
    }

    front
    {
	type empty;
        faces ((4 5 6 7) (12 13 14 15));
    }

    //minX1
    interface2
    {
	type patch;
        faces ((8 12 15 11));
    }

    outlet
    {
	type patch;
        faces ((10 14 13 9) );
    }

);

mergePatchPairs 
(
(interface1 interface2)
);


// ************************************************************************* //
