src/turbulenceTrial/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          200;
        startFace       47680;
    }
    sym
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          72;
        startFace       47880;
    }
    wedge
    {
        type            wall;
        inGroups        1(wall);
        nFaces          48;
        startFace       47952;
    }
    top
    {
        type            patch;
        nFaces          120;
        startFace       48000;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          24000;
        startFace       48120;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          24000;
        startFace       72120;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       96120;
    }
)

// ************************************************************************* //
